<?php

use Illuminate\Database\Seeder;

class PoemsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        \DB::table('poems')->insert(array(
            [
                'poem_type_id' => 7,
                'author' => '顾贞观',
                'title' => '金缕曲',
                'content' => '季子平安否？便归来，平生万事，那堪回首？行路悠悠谁慰藉？母老家贫子幼。记不起、从前杯酒。魑魅搏人应见惯，总输他、覆雨翻云手！冰与雪，周旋久。泪痕莫滴牛衣透。数天涯、依然骨肉，几家能够？比似红颜多命薄，更不如今还有。只绝塞、苦寒难受。廿载包胥承一诺，盼乌头、马角终相救。置此札，君怀袖。我亦飘零久，十年来，深恩负尽，死生师友。宿昔齐名非忝窃，试看杜陵消瘦。曾不减，夜郎僝僽。薄命长辞知己别，问人生，到此凄凉否？千万恨，为君剖。兄生辛未我丁丑，共些时，冰霜摧折，早衰蒲柳。词赋从今须少作，留取心魂相守。但愿得，河清人寿。归日急翻行戍稿，把空名料理传身后。言不尽，观顿首。',
                'description' => '清顺治十四年，作者好友吴兆骞参加江南乡试中举，后因主考官作弊受牵连，次年三月在北京复试，
                由于考场内有许多清兵巡视，发挥不利，十一月与其他七人一同受责打四十大板，并处抄没家产，举家流放到黑龙江宁古塔。
                该词为作者以词代书寄赠好友的关心劝慰之作。',
                'picture' => 'http://47.254.23.180/images/poem1.jpg',
                'admin_id' => 1,
                'created_at' => \Carbon\Carbon::now(),
                'updated_at' => \Carbon\Carbon::now()
            ],
            [
                'poem_type_id' => 4,
                'author' => '王维',
                'title' => '送别',
                'content' => '山中相送罢，日暮掩柴扉。春草年年绿，王孙归不归。',
                'description' => '【注解】：
                                    又题：《山中送别》
                                    １、柴扉：柴门。
                                    ２、王孙：贵族的子孙，这里指送别的友人。
                                    
                                    【韵译】：
                                    在山中送走了你以后，
                                    夕阳西坠我关闭柴扉。
                                    春草明年再绿的时候，
                                    游子呵你能不能回归？',
                'picture' => 'http://47.254.23.180/images/poem2.jpg',
                'admin_id' => 1,
                'created_at' => \Carbon\Carbon::now(),
                'updated_at' => \Carbon\Carbon::now()
            ],
            [
                'poem_type_id' => 6,
                'author' => '赵秉文',
                'title' => '青杏儿·风雨替花愁',
                'content' => '风雨替花愁。风雨罢，花也应休。劝君莫惜花前醉，今年花谢，明年花谢，白了人头。乘兴两三瓯。拣溪山好处追游。但教有酒身无事，有花也好，无花也好，选甚春秋。',
                'description' => '赵秉文的这首《青杏儿》好就好在不与前人雷同，风格清新，语句明白如话，
                以白描的手法，本色天然，流畅自然，与古代众多的游春词相比，确实可谓别有一番清新的韵味。
                然而，《青杏儿》的作者却不想用更多的悲凉、迟暮感来感染读者。笔调轻轻一转，“乘兴两三瓯”，
                意境立刻由沉闷、苦恼转向了明彻、欢快。“莫惜”深化为“乘兴”，揭示人们要积极开创美好的生活，良辰美景、赏心乐事要尽情享受。
                两三盏渍酒，听江山清风，观山间明长，柳绿花红，莺飞草长，造物是这样的神奇，大自然是这样的美妙，
                人们啊，要“拣溪山好处追游”得欢愉时且欢愉，莫要自寻烦恼。“但教有酒身无事，有花也好，无花也好，选甚春秋。”只要胸襟豁达，有美酒相伴，无俗事缠身，有花也罢，无花也罢，春天永远常在，春光永远无限！这是多么豁达的胸襟，多么美美好的人生感触，愿每人心中都似春光常驻！',
                'picture' => 'http://47.254.23.180/images/poem3.jpg',
                'admin_id' => 1,
                'created_at' => \Carbon\Carbon::now(),
                'updated_at' => \Carbon\Carbon::now()
            ],
            [
                'poem_type_id' => 1,
                'author' => '诗经',
                'title' => '关雎',
                'content' => '关关雎鸠，在河之洲。窈窕淑女，君子好逑。参差荇菜，左右流之。窈窕淑女，寤寐求之。求之不得，寤寐思服。悠哉悠哉，辗转反侧。参差荇菜，左右采之。窈窕淑女，琴瑟友之。参差荇菜，左右芼之。窈窕淑女，钟鼓乐之。',
                'description' => '对《关雎》，我们应当从诗义和音乐两方面去理解。就诗义而言，它是“民俗歌谣”，所写的男女爱情是作为民俗反映出来的。
                相传古人在仲春之月有会合男女的习俗。《周礼·地官·媒氏》云：“媒氏(即媒官)掌万民之判(配合)。……中春(二月)之月，令会男女，于是时也，奔者不禁(不禁止奔)；
                若无故而不用令者，罚之，司男女之无夫家者而会之。”《关雎》所咏未必就是这段史事的记实，但这段史实却有助于我们了解古代男女相会、
                互相爱慕并希望成婚的心理状态和风俗习尚。文学作品描写的对象是社会生活，对社会风俗习尚的描写能更真实地再现社会生活，
                使社会生活融汇于社会风习的画面中，从而就更有真实感。《关雎》就是把古代男女恋情作为社会风俗习尚描写出来的。就乐调而言，全诗重章叠句都是为了合乐而形成的。
                郑樵《通志·乐略·正声序论》云：“凡律其辞，则谓之诗，声其诗，则谓之歌，作诗未有不歌者也。”郑樵特别强调声律的重要性。凡古代活的有生气的诗歌，往往都可以歌唱，
                并且重视声调的和谐。《关雎》重章叠句的运用，说明它是可歌的，是活在人们口中的诗歌。当然，《关雎》是把表达诗义和疾徐声调结合起来，以声调传达诗义。
                郑玄《诗谱序》云：“《虞书》曰：‘诗言志，歌永言，声依永，律和声。’然则诗之道，放于此乎?” ',
                'picture' => 'http://47.254.23.180/images/poem4.jpg',
                'admin_id' => 1,
                'created_at' => \Carbon\Carbon::now(),
                'updated_at' => \Carbon\Carbon::now()
            ],
            [
                'poem_type_id' => 2,
                'author' => '屈原',
                'title' => '楚辞-九歌-云中君',
                'content' => '浴兰汤兮沐芳，华采衣兮若英。灵连蜷兮既留，烂昭昭兮未央。謇将憺兮寿宫，与日月兮齐光。龙驾兮帝服，聊翱游兮周章。灵皇皇兮既降，猋远举兮云中。览冀洲兮有余，横四海兮焉穷。思夫君兮太息，极劳心兮忡忡。',
                'description' => '《九歌》是屈赋中最精、最美、最富魅力的诗篇。它代表了屈原艺术创作的最高成就。《九歌》以楚国宗祖的功德和英雄业绩为诗；
                以山川神祇和自然风物为诗；以神话故事和历史传说为诗，淋漓尽致地抒发了诗人晚年放逐南楚沅湘之间忠君爱国、忧世伤时的愁苦心情和“荡志而愉乐”，“聊以舒吾忧心”，
                “寓情草木，托意男女”，“吟咏情性，以风其上”的心旨。',
                'picture' => 'http://47.254.23.180/images/poem5.jpg',
                'admin_id' => 1,
                'created_at' => \Carbon\Carbon::now(),
                'updated_at' => \Carbon\Carbon::now()
            ],
            [
                'poem_type_id' => 3,
                'author' => '张衡',
                'title' => '归田赋',
                'content' => '浴游都邑以永久，无明略以佐时。徒临川以羡鱼，俟河清乎未期。感蔡子之慷慨，从唐生以决疑。谅天道之微昧，追渔父以同嬉。超埃尘以遐逝，与世事乎长辞。于是仲春令月，时和气清；原隰郁茂，百草滋荣。王雎鼓翼，仓庚哀鸣；交颈颉颃，关关嘤嘤。于焉逍遥，聊以娱情。尔乃龙吟方泽，虎啸山丘。仰飞纤缴，俯钓长流。触矢而毙，贪饵吞钩。落云间之逸禽，悬渊沉之鲨鰡。于时曜灵俄景，继以望舒。极般游之至乐，虽日夕而忘劬。感老氏之遗诫，将回驾乎蓬庐。弹五弦之妙指，咏周、孔之图书。挥翰墨以奋藻，陈三皇之轨模。苟纵心于物外，安知荣辱之所如。',
                'description' => '张衡的大多数作品都表现出对现实的否定与批评。他探讨人生玄妙哲理，也探寻合于自己理想与性格的生活空间。于是，
                田园的环境、心境，恰与官场、仕途形成对比。《归田赋》的艺术表现形式和语言运用，也同他所展现的内容相称。作者一反《思玄赋》等作品中的艺术表现习惯，
                此赋篇幅短小，语言清新自然。与作品所展现的环境、心情浑然一体。这些特点使《归田赋》成为中国文学史上第一篇描写田园隐居乐趣的作品，
                同时，它也是汉代第一篇比较成熟的骈体赋。无论从张衡的全部创作看，还是从汉赋的发展过程看，《归田赋》都具有重要的意义。',
                'picture' => 'http://47.254.23.180/images/poem6.jpg',
                'admin_id' => 1,
                'created_at' => \Carbon\Carbon::now(),
                'updated_at' => \Carbon\Carbon::now()
            ],
            [
                'poem_type_id' => 5,
                'author' => '葛长庚',
                'title' => '水调歌头 江上春山远',
                'content' => '江上春山远，山下暮云长。相留相送，时见双燕语风樯。满目飞花万点，回首故人千里，把酒沃愁肠。回雁峰前路，烟树正苍苍。漏声残，灯焰短，马蹄香。浮云飞絮，一身将影向潇湘。多少风前月下，迤逦天涯海角，魂梦亦凄凉。又是春将暮，无语对斜阳。',
                'description' => '葛长庚有云游四方和道士生活的薰陶，因而他的作品清隽飘逸。这阕词赋离愁，从“春山”、“暮云”以下，选用一连串最能叫人愁绝的景物，
                间用比兴与直接抒写之法，多方面渲染个人情绪，写得愁肠百转，深沉郁结。然而词篇从“相留相送”写起，一气经过回雁峰、潇湘，直至天涯海角，又似江河流注，
                虽千回百转，却能一往直前。气脉贯通，气韵生动，实是词中珍品。',
                'picture' => 'http://47.254.23.180/images/poem7.jpg',
                'admin_id' => 1,
                'created_at' => \Carbon\Carbon::now(),
                'updated_at' => \Carbon\Carbon::now()
            ],
        ));
    }
}
